export const validation = {
    /*-------------------
    UPDATE USER NOTE
    --------------------*/

    VAL_NAME_REQ: "Το πεδίο του ονόματος απαιτείται.",
    VAL_SUR_REQ: "Το πεδίο του επωνύμου απαιτείται.",
    VAL_MAIL_REQ: "Το πεδίο του email απαιτείται.",
    VAL_MAIL_MAIL: "Το email πρέπει να είναι ένας έγκυρος διευθυνσιοδότης email.",
    VAL_MAIL_UNIQ: "Το email έχει ήδη χρησιμοποιηθεί.",
    VAL_USERNAME_REQ: "Το πεδίο του ονόματος χρήστη απαιτείται.",
    VAL_USERNAME_REGEX: "Η μορφή του ονόματος χρήστη είναι άκυρη.",
    VAL_USERNAME_UNIQ: "Το όνομα χρήστη έχει ήδη χρησιμοποιηθεί.",
    VAL_PHONE_NUMERIC: "Το τηλέφωνο πρέπει να είναι αριθμός.",
    VAL_PHONE_DIGIT: "Το τηλέφωνο πρέπει να είναι 10 ψηφία.",
    VAL_PHONE_UNIQ: "Το τηλέφωνο έχει ήδη χρησιμοποιηθεί.",
    VAL_AVATAR_MIME: "Το avatar πρέπει να είναι αρχείο τύπου: .jpg, .jpeg, .png.",
    VAL_PASSWORD_CONFIRMED: "Η επιβεβαίωση κωδικού δεν ταιριάζει.",
    VAL_PASSWORD_DIGITS: "Ο κωδικός πρέπει να είναι από 6 έως 24 ψηφία.",
    VAL_PASSWORD_DEFAULTS: "",
    VAL_INVITATION_FAIL: "Δεν βρέθηκε πρόσκληση. Ο σύνδεσμος μπορεί να έχει ήδη χρησιμοποιηθεί ή να έχει λήξει.",
    VAL_SUCCESS: "Το προφίλ ενημερώθηκε",
    CLIENT_TOKEN_ERROR: "Αντιμετωπίσαμε ένα πρόβλημα. Παρακαλώ δοκιμάστε ξανά αργότερα.",

    /*---------------------
    FEEDBACKS
    --------------------- */

    VAL_TYPE_REQ: "Το πεδίο του τύπου απαιτείται.",
    VAL_DETAIL_REQ: "Το πεδίο των λεπτομερειών απαιτείται.",

    /*---------------------
    CONTENT MODAL
    --------------------- */

    textError: "Το κείμενο πρέπει να είναι τουλάχιστον 3 χαρακτήρες.",
    httpError: "Παρακαλώ προσθέστε 'http://' ή 'https://' πριν από το url της ιστοσελίδας",
    iframeError: "Παρακαλώ προσθέστε κωδικό που ξεκινά με '<iframe'",
    fileError: "Πρέπει να προστεθεί αρχείο"
}
